<a href="https://colab.research.google.com/github/learningwithkamal/ML_Basics/blob/master/DataWrangling.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [0]:
titanic_df = pd.read_csv(filepath_or_buffer="https://raw.githubusercontent.com/learningwithkamal/ML_Basics/master/Titanic_train.csv")

# **Viewing the data types of fileds in dataset**

In [38]:
titanic_df.dtypes

PassengerId      int64
Survived       float64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
WikiId         float64
Name_wiki       object
Age_wiki       float64
Hometown        object
Boarded         object
Destination     object
Lifeboat        object
Body            object
Class          float64
dtype: object

# **Viewing the data content**

In [39]:
titanic_df.head(5)

   PassengerId  Survived  Pclass  ... Lifeboat Body  Class
0            1       0.0       3  ...      NaN  NaN    3.0
1            2       1.0       1  ...        4  NaN    1.0
2            3       1.0       3  ...      14?  NaN    3.0
3            4       1.0       1  ...        D  NaN    1.0
4            5       0.0       3  ...      NaN  NaN    3.0

[5 rows x 21 columns]

# **Data Description.**
It gives idea about the data content and summary of values in the fields

In [40]:
titanic_df.describe()

       PassengerId    Survived      Pclass  ...       WikiId    Age_wiki       Class
count   891.000000  891.000000  891.000000  ...   889.000000  887.000000  889.000000
mean    446.000000    0.383838    2.308642  ...   665.466817   29.322063    2.307087
std     257.353842    0.486592    0.836071  ...   380.796997   13.930089    0.837713
min       1.000000    0.000000    1.000000  ...     1.000000    0.420000    1.000000
25%     223.500000    0.000000    2.000000  ...   336.000000   20.000000    2.000000
50%     446.000000    0.000000    3.000000  ...   672.000000   28.000000    3.000000
75%     668.500000    1.000000    3.000000  ...   996.000000   38.000000    3.000000
max     891.000000    1.000000    3.000000  ...  1314.000000   74.000000    3.000000

[8 rows x 10 columns]

# ***Identifying the columns with unique values ***

In [41]:
print (titanic_df.shape)
titanic_df.nunique()

(891, 21)

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             88
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          147
Embarked         3
WikiId         889
Name_wiki      889
Age_wiki        74
Hometown       437
Boarded          4
Destination    234
Lifeboat        22
Body            87
Class            3
dtype: int64

# **Identifying null values**

In [42]:
titanic_df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
WikiId           2
Name_wiki        2
Age_wiki         4
Hometown         2
Boarded          2
Destination      2
Lifeboat       546
Body           804
Class            2
dtype: int64

# **Anlyzing the rows with null values in some columns**

In [43]:
##df = titanic_df['Age'].isna()== True
df = titanic_df.loc[titanic_df['Age'].isna() == False]
df.shape

(714, 21)

In [44]:
df = titanic_df.loc[titanic_df['Age'].isna() == True]
df = df.loc[df['Survived'] == 1.0]
df.shape
##df.head(30)

(52, 21)

In [45]:
df = titanic_df.loc[titanic_df['Survived'] == 1.0]
df.describe()

       PassengerId  Survived      Pclass  ...       WikiId   Age_wiki       Class
count   342.000000     342.0  342.000000  ...   341.000000  341.00000  341.000000
mean    444.368421       1.0    1.950292  ...   506.026393   28.44478    1.944282
std     252.358840       0.0    0.863321  ...   367.127085   14.20893    0.864226
min       2.000000       1.0    1.000000  ...     1.000000    0.42000    1.000000
25%     250.750000       1.0    1.000000  ...   182.000000   20.00000    1.000000
50%     439.500000       1.0    2.000000  ...   446.000000   28.00000    2.000000
75%     651.500000       1.0    3.000000  ...   786.000000   37.00000    3.000000
max     890.000000       1.0    3.000000  ...  1311.000000   63.00000    3.000000

[8 rows x 10 columns]

In [0]:
titanic_df['Age'].fillna(titanic_df.mean()['Age'],inplace = True)

In [47]:
titanic_df.describe()
titanic_df.shape

(891, 21)

In [48]:
df = titanic_df.loc[titanic_df['Age'].isna() == True]
df.shape

(0, 21)

# **Hot key encoding using pandas**

In [49]:
df = pd.get_dummies(titanic_df['Sex'])
df

     female  male
0         0     1
1         1     0
2         1     0
3         1     0
4         0     1
..      ...   ...
886       0     1
887       1     0
888       1     0
889       0     1
890       0     1

[891 rows x 2 columns]

In [50]:
df = titanic_df.join(df)
print(df.head(5))

   PassengerId  Survived  Pclass  ... Class female  male
0            1       0.0       3  ...   3.0      0     1
1            2       1.0       1  ...   1.0      1     0
2            3       1.0       3  ...   3.0      1     0
3            4       1.0       1  ...   1.0      1     0
4            5       0.0       3  ...   3.0      0     1

[5 rows x 23 columns]

In [51]:
df = df.drop('Sex',axis = 1)
print(df.head(5))

   PassengerId  Survived  Pclass  ... Class  female  male
0            1       0.0       3  ...   3.0       0     1
1            2       1.0       1  ...   1.0       1     0
2            3       1.0       3  ...   3.0       1     0
3            4       1.0       1  ...   1.0       1     0
4            5       0.0       3  ...   3.0       0     1

[5 rows x 22 columns]